{
  "__demo_comment_1": "The property HttpHeaders specifies a set of headers to include in all messages sent from the Docker client to the daemon. Docker does not try to interpret or understand these header; it simply puts them into the messages.   Docker does not allow these headers to change any headers it sets for itself.",
  "HttpHeaders": {
    "MyHeader": "MyValue"
  },
  "__demo_comment_2": "The property psFormat specifies the default format for docker ps output. When the --format flag is not provided with the docker ps command, Docker’s client uses this property. If this property is not set, the client falls back to the default table format.",
  "psFormat": "table {{.ID}}\\t{{.Image}}\\t{{.Command}}\\t{{.Labels}}",
  "imagesFormat": "table {{.ID}}\\t{{.Repository}}\\t{{.Tag}}\\t{{.CreatedAt}}",
  "pluginsFormat": "table {{.ID}}\t{{.Name}}\t{{.Enabled}}",
  "statsFormat": "table {{.Container}}\t{{.CPUPerc}}\t{{.MemUsage}}",
  "servicesFormat": "table {{.ID}}\t{{.Name}}\t{{.Mode}}",
  "secretFormat": "table {{.ID}}\t{{.Name}}\t{{.CreatedAt}}\t{{.UpdatedAt}}",
  "configFormat": "table {{.ID}}\t{{.Name}}\t{{.CreatedAt}}\t{{.UpdatedAt}}",
  "__demo_comment_3": "The various output formatter have certain short-hand directives that can be used in place of the pattern based style. In the case of serviceInspectFormat using the value \"pretty\" tells docker to print the information in a human friendly format.",
  "serviceInspectFormat": "pretty",
  "nodesFormat": "table {{.ID}}\t{{.Hostname}}\t{{.Availability}}",
  "detachKeys": "ctrl-e,e",
  "auths": {},
  "__demo_comment_4": "The property credsStore specifies an external binary to serve as the default credential store. When this property is set, docker login will attempt to store credentials in the binary specified by docker-credential-<value> which is visible on $PATH. If this property is not set, credentials will be stored in the auths property of the config.",
  "credsStore": "wincred",
  "__demo_comment_5": "The property credHelpers specifies a set of credential helpers to use preferentially over credsStore or auths when storing and retrieving credentials for specific registries. If this property is set, the binary docker-credential-<value> will be used when storing or retrieving credentials for a specific registry.",
  "credHelpers": {
    "dtr.BeHeroes.dk": "wincred"
  },
  "__demo_comment_6": "The property stackOrchestrator specifies the default orchestrator to use when running docker stack management commands. Valid values are \"swarm\", \"kubernetes\", and \"all\". This property can be overridden with the DOCKER_STACK_ORCHESTRATOR environment variable, or the --orchestrator flag.",
  "stackOrchestrator": "swarm"
}